In [13]:
import pandas as pd 

data = {
    'name': ['Nam Tran', 'Huy Nguyen', 'Minh Huy', 'Lam Le', 'Dat Nguyen'],
    'city': ['HCM city', 'Ha Noi city', 'Ha Noi city', 'Da Nang city', 'HCM city'],
    'age': [18, 19, 23, 17, 22],
    'py-core': [82.0, 79.0, 89.0, 96.0, 94.0]
}
row_labels = [1, 2, 3, 4, 5]
df = pd.DataFrame(data=data, index=row_labels)
df

         name          city  age  py-core
1    Nam Tran      HCM city   18     82.0
2  Huy Nguyen   Ha Noi city   19     79.0
3    Minh Huy   Ha Noi city   23     89.0
4      Lam Le  Da Nang city   17     96.0
5  Dat Nguyen      HCM city   22     94.0

In [18]:
# Lấy các giá trị đầu
df.head(n=2)

         name         city  age  py-core
1    Nam Tran     HCM city   18     82.0
2  Huy Nguyen  Ha Noi city   19     79.0

In [20]:
# Lấy các giá trị cuối
df.tail(n=2)

         name          city  age  py-core
4      Lam Le  Da Nang city   17     96.0
5  Dat Nguyen      HCM city   22     94.0

In [25]:
# Lấy giá trị 1 cột
cities = df['city']
cities

1        HCM city
2     Ha Noi city
3     Ha Noi city
4    Da Nang city
5        HCM city
Name: city, dtype: object

In [28]:
# Lấy 1 row của city
cities[4]

'Da Nang city'

In [33]:
# Truy cập toàn bộ hành
df.loc[4]

name             Lam Le
city       Da Nang city
age                  17
py-core            96.0
Name: 4, dtype: object

In [35]:
df

         name          city  age  py-core
1    Nam Tran      HCM city   18     82.0
2  Huy Nguyen   Ha Noi city   19     79.0
3    Minh Huy   Ha Noi city   23     89.0
4      Lam Le  Da Nang city   17     96.0
5  Dat Nguyen      HCM city   22     94.0

In [38]:
# Lọc giá trị theo chỉ số
df.iloc[4]

name       Dat Nguyen
city         HCM city
age                22
py-core          94.0
Name: 5, dtype: object

In [41]:
import numpy as np
import pandas as pd

d = {
    'x': [1, 2, 3],
    'y': np.array([2, 4, 8]),
    'z': 100
}
pd.DataFrame(d)

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [51]:
pd.DataFrame(d, index = [100, 200, 300], columns=['z', 'y', 'x'])

       z  y  x
100  100  2  1
200  100  4  2
300  100  8  3

In [55]:
# Tạo datafram bằng nested list
l = [[1, 2, 100],
     [2, 4, 100],
     [3, 8, 100]]
pd.DataFrame(l, columns=['x', 'y', 'z'])

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [81]:
# Tạo DataFrame bằng tuples
persion = ("John", 30, "New York")
personb = ("Doe", 25, "Chicago")

name = persion[0]
age = persion[1]
city = persion[2]
print(f"Name: {name}")

df = pd.DataFrame(persion, index=["1", "2", "3"], columns=['per'])
df
# df = df.append(personb, ignore_index=True)
# df

Name: John

        per
1      John
2        30
3  New York

In [84]:
# Tạp DataFrame với NumPy Arrays
arr = np.array([[1, 2, 100],
                [2, 4, 100],
                [3, 8, 100]])
df_ = pd.DataFrame(arr, columns=['x', 'y', 'z'])
df_

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [86]:
# Nếu sửa đổi arr thì DataFrame sẽ thay đổi theo
arr[0, 0] = 0

df_

   x  y    z
0  0  2  100
1  2  4  100
2  3  8  100

In [88]:
# Lưu DataFrame vào file csv
df.to_csv('data1.csv')

In [93]:
df = pd.read_csv('data1.csv', index_col=0)
df

         name          city  age  py-score
1    Nam Tran      HCM city   18        80
2  Huy Nguyen   Ha Noi city   19        79
3    Minh Huy   Ha Noi city   23        89
4      Lam Le  Da Nang city   17        96
5  Dat Nguyen      HCM city   22        94

In [ ]:
# Phần 2: Truy xuất Labels và Data